using System;
using System.Collections.Generic;
using System.Text;

namespace NGE.Network
{
	//非标准的RUDP协议头
	//----------------------------------------------------------------
	//| 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 |          16bit               |
	//----------------------------------------------------------------
	//|          Control Bits         |                              |
	//|SYN|ACK|EAK|RST|NUL|CHK|TCS| 0 |       Packet Length          |
	//----------------------------------------------------------------
	//|           Sequence number     |       Ack number             |
	//----------------------------------------------------------------
	//|           Header Checksum     |       Data Checksum          |
	//----------------------------------------------------------------
	////////////////////////////////////////////////////////////////////////
	//        Control Bits
	//SYN: SYN 位表示当前为同步段 
	//ACK: ACK 位表示协议头有效的承认序号。 
	//EACK:EACK位表示当前为扩展承认字段。 
	//RST: RST 位表示该数据包为复位字段。 
	//NUL: NUL 位表示该数据包为空字段。. 
	//CHK: CHK 位表示检验和字段是否包含协议头或协议头与主体（数据）的检验和。 
	//TCS: TCS 位表示该数据包是传输连接状态字段。 
	//0:   表示该字段的值必须设置为0。

	internal struct RudpHeader
	{
	}
}
